app/views/wizards/show.html.erb

SELECT "spells".* FROM "spells" INNER JOIN "favorite_spells" ON "spells"."id" = "favorite_spells"."spell_id" WHERE "favorite_spells"."wizard_id" = ?  [["wizard_id", 152]]
---

<% @wizard.spells.each do |spell| %>