app/controllers/favorite_spells_controller.rb

SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 152], ["LIMIT", 1]]
SELECT "spells".* FROM "spells"
---
    def new
        @wizard = Wizard.find(params[:id])
        @spells = Spell.all

INSERT INTO "favorite_spells" ("wizard_id", "spell_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wizard_id", 152], ["spell_id", 218], ["created_at", "2019-09-24 22:21:00.078900"], ["updated_at", "2019-09-24 22:21:00.078900"]]
INSERT INTO "favorite_spells" ("wizard_id", "spell_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wizard_id", 158], ["spell_id", 230], ["created_at", "2019-09-25 13:14:38.535014"], ["updated_at", "2019-09-25 13:14:38.535014"]]
---
    def create
        @favorite_spell = FavoriteSpell.create(wizard_id: params[:favorite_spell][:wizard_id], spell_id: params[:favorite_spell][:spell_id])
        @favorite_spell.save