app/controllers/spells_controller.rb

    def index
        @spells = Spell.all.sort_by{|spell_hash| spell_hash[:name]}
---
SELECT "spells".* FROM "spells"

    def show
        @spell = Spell.find(params[:id])
        @favorite_spell_ids = FavoriteSpell.all.select{|s| s.spell_id == @spell.id}
        @wizard_ids = @favorite_spell_ids.map{|s| s.wizard_id}
---
SELECT  "spells".* FROM "spells" WHERE "spells"."id" = ? LIMIT ?  [["id", 219], ["LIMIT", 1]]
SELECT "favorite_spells".* FROM "favorite_spells"
SELECT "wizards".* FROM "wizards"

    def create
        @spell = Spell.new(name: params[:spell][:name], description: params[:spell][:description] )
        @spell.save
---
INSERT INTO "spells" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Fire"], ["description", "FIRIRIRIIR"], ["created_at", "2019-09-25 00:09:36.627124"], ["updated_at", "2019-09-25 00:09:36.627124"]]