app/controllers/wizards_controller.rb

  def index
    @wizards = Wizard.all
---
SELECT "wizards".* FROM "wizards"

  def show
    @wizard = Wizard.find(params[:id])
---
SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 154], ["LIMIT", 1]]

  def create
    @wizard = Wizard.new(wizard_params)
    @wizard.save
---
INSERT INTO "wizards" ("name", "house", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ae"], ["house", "Hufflepuff"], ["age", 3], ["created_at", "2019-09-24 19:30:41.016675"], ["updated_at", "2019-09-24 19:30:41.016675"]]

  def edit
    @wizard = Wizard.find(params[:id])
---
SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 153], ["LIMIT", 1]]

  def update
    @wizard = Wizard.find(params[:id])
    @wizard.update(wizard_params)
---
SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "wizards" SET "age" = ?, "updated_at" = ? WHERE "wizards"."id" = ?  [["age", 19], ["updated_at", "2019-09-24 20:21:03.221313"], ["id", 153]]

  def destroy
    @wizard = Wizard.find(params[:id])
    byebug
    @wizard.favorite_spells.destroy_all
    @wizard.destroy
---
SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 154], ["LIMIT", 1]]
DELETE FROM "wizards" WHERE "wizards"."id" = ?  [["id", 3]]
DELETE FROM "favorite_spells" WHERE "favorite_spells"."id" = ?  [["id", 77]]
DELETE FROM "wizards" WHERE "wizards"."id" = ?  [["id", 162]]